Repository: matiapa/astroai
Catalog: frontend/lib/l10n/app_*.arb
Languages: es

# settingsTitle
source: Settings
es: Ajustes

# appTitle
source: AstroAI
es: AstroGuía

# settingsPlaybackSection
source: PLAYBACK
es: REPRODUCCIÓN

# settingsAutoPlay
source: Auto-play narration
es: Reproducción automática

# settingsAutoPlaySubtitle
source: Automatically play audio after analysis
es: Reproducir audio automáticamente tras análisis

# settingsLanguageSection
source: LANGUAGE
es: IDIOMA

# settingsLanguage
source: Language
es: Idioma

# settingsLanguageEn
source: English
es: Inglés

# settingsLanguageEs
source: Espa√±ol
es: Español

# settingsAboutSection
source: ABOUT
es: ACERCA DE

# settingsVersion
source: Version {version}
es: Versión {version}

# settingsOpenSourceLicenses
source: Open source licenses
es: Licencias de código abierto

# analysisFailed
source: Analysis failed: {error}
es: Error de análisis: {error}

source: Analyzing Cosmos
es: Analizando el Cosmos

source: Consulting Archives
es: Consultando Archivos

source: Synthesizing Voice
es: Sintetizando Voz

source: Discovery Complete
es: Descubrimiento Completo

source: Processing...
es: Procesando...

# identifyingCelestialObjects
source: Identifying stars, nebulae, and galaxies...
es: Identificando estrellas, nebulosas y galaxias...

# craftingStory
source: Crafting a story for your discovery...
es: Creando una historia para tu descubrimiento...

# preparingAudioGuide
source: Preparing your audio guide...
es: Preparando tu audioguía...

source: Preparing results...
es: Preparando resultados...

source: Please wait...
es: Por favor espera...

# assetNotFound
source: Asset not found: {assetPath}
es: Recurso no encontrado: {assetPath}

# errorPickingImage
source: Error picking image: {error}
es: Error seleccionando imagen: {error}

# captureError
source: Capture error: {error}
es: Error de captura: {error}

# cameraNotAvailable
source: Camera not available: {error}
es: Cámara no disponible: {error}

source: Opening Camera...
es: Abriendo Cámara...

source: Loading Camera...
es: Cargando Cámara...

source: Or select from gallery / catalog
es: O selecciona de galería / catálogo

# galleryButton
source: Gallery
es: Galería

# catalogButton
source: Catalog
es: Catálogo

source: No analysis data found
es: No se encontraron datos de análisis

source: Return to Observatory
es: Volver al Observatorio

# generatingAudioStatus
source: GENERATING AUDIO...
es: GENERANDO AUDIO...

# analysisCompleteStatus
source: ANALYSIS COMPLETE
es: ANÁLISIS COMPLETO

source: Ask about this view
es: Preguntar sobre esta vista

source: Tap for details
es: Toca para detalles

source: View less
es: Ver menos

source: View more
es: Ver más

# coordinatesLabel
source: Coordinates
es: Coordenadas

# distanceLabel
source: Distance
es: Distancia

# magnitudeLabel
source: Magnitude
es: Magnitud

# spectralTypeLabel
source: Spectral Type
es: Tipo Espectral

# morphologyLabel
source: Morphology
es: Morfología

# alsoKnownAsLabel
source: Also Known As
es: También conocido como

# generatingAudioTitle
source: GENERATING AUDIO
es: GENERANDO AUDIO

# audioNarrationPending
source: Audio narration will appear here shortly
es: La narración de audio aparecerá pronto

# navObservatory
source: Observatory
es: Observatorio

# navLog
source: Log
es: Bitácora

# navSettings
source: Settings
es: Ajustes

# logbookTitle
source: My Discoveries
es: Mis Descubrimientos

# logbookSearchHint
source: Scan for objects...
es: Escanear objetos...

# logbookEmpty
source: No discoveries yet
es: Aún no hay descubrimientos

# logbookNoResults
source: No matching discoveries
es: No hay coincidencias

# logbookEmptyHint
source: Capture your first sky image to begin
es: Captura tu primera imagen para comenzar

# logbookNoResultsHint
source: Try a different search term
es: Prueba otro término de búsqueda

source: Go to Observatory
es: Ir al Observatorio

source: Coming Soon
es: Próximamente

source: Chat Feature Coming Soon
es: Función de Chat Próximamente

# chatFutureUpdate
source: The AI-powered chat assistant will be available in a future update.
es: El asistente de chat impulsado por IA estará disponible en una actualización futura.

source: Reference Catalog
es: Catálogo de Referencia

# selectSampleImage
source: Select a sample image to analyze
es: Selecciona una imagen de muestra para analizar

# captureLabel
source: Capture
es: Capturar

source: Analyze with AI
es: Analizar con IA

# analyzeLabel
source: Analyze
es: Analizar

# deleteLogTitle
source: Delete Log
es: Eliminar registro

# deleteLogMessage
source: Are you sure you want to delete this log? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar este registro? Esta acción no se puede deshacer.

# cancelButton
source: Cancel
es: Cancelar

# deleteButton
source: Delete
es: Eliminar

# chatWelcomeMessage
source: Hello! I'm Atlas, your astronomy guide. Ask me anything about the night sky, constellations, planets, or celestial events.
es: ¡Hola! Soy Atlas, tu guía de astronomía. Pregúntame lo que quieras sobre el cielo nocturno, constelaciones, planetas o eventos celestes.

# chatSuggestion1
source: What constellations are visible tonight?
es: ¿Qué constelaciones son visibles esta noche?

# chatSuggestion2
source: Tell me about the Orion Nebula
es: Cuéntame sobre la Nebulosa de Orión

# chatSuggestion3
source: I want to plan an observation for tonight
es: ¿Cómo puedo fotografiar la Vía Láctea?

# chatResultsWelcome
source: I have context about your sky analysis. Ask me anything about the objects identified in your image!
es: Tengo contexto sobre tu análisis del cielo. ¡Pregúntame lo que quieras sobre los objetos identificados en tu imagen!

source: Go back
es: Volver
